In [1]:
import pandas as pd
import numpy as np

# Concatenation (birleştirme)

## Concat için veri oluşturma

In [10]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"], 
           "Spor": ["Koşu", "Yüzme", "Koşu","Basketbol"],
          "Kalori": [100,200,300,400]}

In [11]:
dataFrame1 = pd.DataFrame(sozluk1,index = [0,1,2,3])

In [12]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [14]:
sozluk2 = {"Isim" : ["Osman","Levent","Atlas","Fatma"], 
           "Spor": ["Koşu", "Yüzme", "Koşu","Basketbol"],
          "Kalori": [200,100,50,300]}

In [15]:
dataFrame2 = pd.DataFrame(sozluk2, index = [4,5,6,7])

In [16]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [17]:
sozluk3 = {"Isim" : ["Ayşe","Mahmut","Duygu","Nur"], 
           "Spor": ["Koşu", "Yüzme", "Badminton","Tenis"],
          "Kalori": [300,400,500,250]}

In [19]:
dataFrame3 = pd.DataFrame(sozluk3, index = [8,9,10,11])

In [20]:
dataFrame3

      Isim       Spor  Kalori
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## Concat In Action

In [21]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## Concat(axis operasyonları) x = 0 ise alt alta, x = 1 ise yan yana

In [25]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 1)

,Isim,Spor,Kalori,Isim,Spor,Kalori,Isim,Spor,Kalori
0,Ahmet,Koşu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Mehmet,Yüzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Zeynep,Koşu,300.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Atıl,Basketbol,400.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Osman,Koşu,200.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Levent,Yüzme,100.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Atlas,Koşu,50.0,NaN,NaN,NaN
7,NaN,NaN,NaN,Fatma,Basketbol,300.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,Ayşe,Koşu,300.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Mahmut,Yüzme,400.0
10,NaN,NaN,NaN,NaN,NaN,NaN,Duygu,Badminton,500.0
11,NaN,NaN,NaN,NaN,NaN,NaN,Nur,Tenis,250.0

In [26]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 0
         )

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

# Merge (kolon birleşimi)

### Bir Ortak Kolon Üzerinden diğer kolonların birleşimidir.

In [28]:
mergeSozluk1 = {"İsim": ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Spor": ["Koşu","Yüzme","Koşu","Basketbol"]}

In [29]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [30]:
mergeDataFrame1

     İsim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [31]:
mergeSozluk2 = {"İsim": ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Kalori": [100,200,150,250]}

In [32]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [36]:
mergeDataFrame2

     İsim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [37]:
mergeDataFrame1

     İsim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [34]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on = "İsim")

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

# Bazı Trickler

## Sütun İşlemleri

In [38]:
maasSozluk = {"İsim": ["Atıl","Zeynep","Mehmet","Ahmet"],
             "Departman": ["Yazılım", "Satış","Pazarlama","Yazılım"],
             "Maas": [200,300,400,500]}

In [39]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [40]:
maasDataFrame

     İsim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [41]:
maasDataFrame["Departman"]

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

### Sütunda Hangi Çeşit Elemanlar Var

In [52]:
maasDataFrame["Departman"].unique() ## farklı departman türleri

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

### Sütundaki Elman Çeşit Sayısı

In [46]:
maasDataFrame["Departman"].nunique() ## farklı departman türleri sayısı

3

### Sütunda Hangi Çeşitten Kaç Tane Var

In [48]:
maasDataFrame["Departman"].value_counts() ## farklı departmanlardan kaç tane var

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

## Fonksiyonları Sütunlara Uygulama (apply)

In [50]:
def bruttenNete(maas):
    return maas * 0.66

In [51]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

## Null Kontrol Etme

In [53]:
maasDataFrame.isnull()

    İsim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

## Pivot Table Kullanımı

### Kısaca Aynı Türdeki (Değerdeki) Elemanlara İşlemler Yapar

### Pivot Table için veri üretimi

In [65]:
yeniBirVeri = {"Karakter Sınıfı": ["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter İsmi": ["Cartman","Kenny","Homer","Bart","Bart"],
              "Karakter Yas": [9,10,50,20,10
                            ]}

In [66]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [67]:
karakterDF

  Karakter Sınıfı Karakter İsmi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

### DataFrame.pivot_table(values =  işlem yapacağımız değerler, Index =  İşlem Yapacağımız Değerlerin Indexleri)

In [68]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı","Karakter İsmi"])

                               Karakter Yas
Karakter Sınıfı Karakter İsmi
Simpson         Bart                     15
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

#### pilot_table (...., aggfunc = np.sum) bu attribute ile toplama yapılır

In [69]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı","Karakter İsmi"],aggfunc=np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter İsmi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [70]:
karakterDF

  Karakter Sınıfı Karakter İsmi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [71]:
karakterDF["Karakter Yas"].apply(np.sum)

0     9
1    10
2    50
3    20
4    10
Name: Karakter Yas, dtype: int64

## Sütun Toplamı Alma

In [73]:
np.sum(karakterDF["Karakter Yas"])

99